# *data load*

In [1]:
import pandas as pd

In [2]:
import pickle

In [6]:
with open('../../data/sample.pickle', 'rb') as f:
    df = pickle.load(f)

In [7]:
df.head()

  value
0   123
1   123
2   123
3  asdf
4   아리랑

#

# *set 중복 제거*

In [5]:
category_list = list(set(df.category_name_str.values.tolist()))

In [6]:
category_list.sort()
category_list[:10]

[' ',
 'O2O, 이동수단',
 'etc',
 '개발',
 '개발, 경제',
 '개발, 과학',
 '개발, 통신',
 '경제',
 '경제, 식품',
 '경제, 에너지']

#

# *특수문자 제거*

In [7]:
import re

In [8]:
category_list = [re.sub(r'\([^]]*\)', '', category) for category in category_list if len(category) > 0]

In [9]:
category_list[:10]

[' ',
 'O2O, 이동수단',
 'etc',
 '개발',
 '개발, 경제',
 '개발, 과학',
 '개발, 통신',
 '경제',
 '경제, 식품',
 '경제, 에너지']

#

# *빈칸 찾기*

In [11]:
# true, false
# sum 갯수
df.category_name_str.apply(lambda x: x.startswith(" ")).sum()

0

In [12]:
df[df.category_name_str.apply(lambda x: x.startswith(" "))]

Empty DataFrame
Columns: [id, content, category_name_str]
Index: []

In [13]:
df.shape

(1000, 3)

In [10]:
# 데이터 제거
index = df[df.category_name_str.apply(lambda x: x.startswith(" "))].index
print(index)
df.drop(index, inplace=True)

Int64Index([1000], dtype='int64')

#

# *중복 찾기*

In [17]:
df.duplicated().sum()

0

In [ ]:
df.drop_duplicates()

In [15]:
df.shape

(1001, 3)

#

# *2차원 list -> 1차원 list*

In [10]:
test_list = []
test_list.append(category_list)

In [12]:
test_list = sum(test_list, [])

In [14]:
test_list[:10]

[' ',
 'O2O, 이동수단',
 'etc',
 '개발',
 '개발, 경제',
 '개발, 과학',
 '개발, 통신',
 '경제',
 '경제, 식품',
 '경제, 에너지']

#

# *조건부 삭제*

In [ ]:
# 길이 50 이하 제거
df = df[df.content.apply(lambda x: len(str(x))>=50)]

#

# *replace*

In [5]:
df.head()

  id                                            content category_name_str
0  0  김영환 전 더불어민주당 의원은 16일 문재인 정부의 탈원전 정책에 대해 과학적으로 ...               에너지
1  1  올해 2분기 주요 아티스트들의 대거 복귀를 앞두고 엔터주 주가가 꿈틀거리고 있다 앞...           미디어, 경제
2  2  더불어민주당 부동산특위는 오늘 국회에서 서울지역 구청장들과 간담회를 하고 부동산 현...               부동산
3  3  지난 12일 내년 대통령선거 출마를 공식선언한 양승조 충남지사가 16일부터 2박3일...               etc
4  4  서동균이 결혼한 가운데 박준형이 참석 인증샷을 공개했다박준형은 15일 자신의 인스타...               etc

In [6]:
df['category'] = df.category_name_str.replace('etc', 'etcc')

In [7]:
df.head()

,id,content,category_name_str,category
0,0,김영환 전 더불어민주당 의원은 16일 문재인 정부의 탈원전 정책에 대해 과학적으로 ...,에너지,에너지
1,1,올해 2분기 주요 아티스트들의 대거 복귀를 앞두고 엔터주 주가가 꿈틀거리고 있다 앞...,"미디어, 경제","미디어, 경제"
2,2,더불어민주당 부동산특위는 오늘 국회에서 서울지역 구청장들과 간담회를 하고 부동산 현...,부동산,부동산
3,3,지난 12일 내년 대통령선거 출마를 공식선언한 양승조 충남지사가 16일부터 2박3일...,etc,etcc
4,4,서동균이 결혼한 가운데 박준형이 참석 인증샷을 공개했다박준형은 15일 자신의 인스타...,etc,etcc

In [18]:
df['catogory2'] = df.category_name_str.apply(lambda x: x.replace(', ', '; '))

In [19]:
df.head()

,id,content,category_name_str,category,catogory2
0,0,김영환 전 더불어민주당 의원은 16일 문재인 정부의 탈원전 정책에 대해 과학적으로 ...,에너지,에너지,에너지
1,1,올해 2분기 주요 아티스트들의 대거 복귀를 앞두고 엔터주 주가가 꿈틀거리고 있다 앞...,"미디어, 경제","미디어, 경제",미디어; 경제
2,2,더불어민주당 부동산특위는 오늘 국회에서 서울지역 구청장들과 간담회를 하고 부동산 현...,부동산,부동산,부동산
3,3,지난 12일 내년 대통령선거 출마를 공식선언한 양승조 충남지사가 16일부터 2박3일...,etc,etcc,etc
4,4,서동균이 결혼한 가운데 박준형이 참석 인증샷을 공개했다박준형은 15일 자신의 인스타...,etc,etcc,etc

#

# *data merge*

In [8]:
df.head()

,id,content,category_name_str,category
0,0,김영환 전 더불어민주당 의원은 16일 문재인 정부의 탈원전 정책에 대해 과학적으로 ...,에너지,에너지
1,1,올해 2분기 주요 아티스트들의 대거 복귀를 앞두고 엔터주 주가가 꿈틀거리고 있다 앞...,"미디어, 경제",미디어; 경제
2,2,더불어민주당 부동산특위는 오늘 국회에서 서울지역 구청장들과 간담회를 하고 부동산 현...,부동산,부동산
3,3,지난 12일 내년 대통령선거 출마를 공식선언한 양승조 충남지사가 16일부터 2박3일...,etc,etc
4,4,서동균이 결혼한 가운데 박준형이 참석 인증샷을 공개했다박준형은 15일 자신의 인스타...,etc,etc

In [9]:
df2 = df[['id', 'category_name_str']]
df2 = pd.DataFrame(df2)

In [10]:
df = df[['id', 'content']]

In [11]:
df.head()

  id                                            content
0  0  김영환 전 더불어민주당 의원은 16일 문재인 정부의 탈원전 정책에 대해 과학적으로 ...
1  1  올해 2분기 주요 아티스트들의 대거 복귀를 앞두고 엔터주 주가가 꿈틀거리고 있다 앞...
2  2  더불어민주당 부동산특위는 오늘 국회에서 서울지역 구청장들과 간담회를 하고 부동산 현...
3  3  지난 12일 내년 대통령선거 출마를 공식선언한 양승조 충남지사가 16일부터 2박3일...
4  4  서동균이 결혼한 가운데 박준형이 참석 인증샷을 공개했다박준형은 15일 자신의 인스타...

In [12]:
df2.head()

  id category_name_str
0  0               에너지
1  1           미디어, 경제
2  2               부동산
3  3               etc
4  4               etc

In [15]:
df3 = pd.merge(df, df2, on='id')

In [18]:
df3.head()

  id                                            content category_name_str
0  0  김영환 전 더불어민주당 의원은 16일 문재인 정부의 탈원전 정책에 대해 과학적으로 ...               에너지
1  1  올해 2분기 주요 아티스트들의 대거 복귀를 앞두고 엔터주 주가가 꿈틀거리고 있다 앞...           미디어, 경제
2  2  더불어민주당 부동산특위는 오늘 국회에서 서울지역 구청장들과 간담회를 하고 부동산 현...               부동산
3  3  지난 12일 내년 대통령선거 출마를 공식선언한 양승조 충남지사가 16일부터 2박3일...               etc
4  4  서동균이 결혼한 가운데 박준형이 참석 인증샷을 공개했다박준형은 15일 자신의 인스타...               etc

#

# *swifter*

##### *A package which efficiently applies any function to a pandas dataframe or series in the fastest available manner*

In [5]:
import swifter

In [6]:
df['category'] = df.category_name_str.swifter.apply(lambda x: x.replace(', ', '; '))

Pandas Apply:   0%|          | 0/1001 [00:00<?, ?it/s]

In [7]:
df.head()

,id,content,category_name_str,category
0,0,김영환 전 더불어민주당 의원은 16일 문재인 정부의 탈원전 정책에 대해 과학적으로 ...,에너지,에너지
1,1,올해 2분기 주요 아티스트들의 대거 복귀를 앞두고 엔터주 주가가 꿈틀거리고 있다 앞...,"미디어, 경제",미디어; 경제
2,2,더불어민주당 부동산특위는 오늘 국회에서 서울지역 구청장들과 간담회를 하고 부동산 현...,부동산,부동산
3,3,지난 12일 내년 대통령선거 출마를 공식선언한 양승조 충남지사가 16일부터 2박3일...,etc,etc
4,4,서동균이 결혼한 가운데 박준형이 참석 인증샷을 공개했다박준형은 15일 자신의 인스타...,etc,etc

#

# *describe*

In [23]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1001 entries, 0 to 1000
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 1001 non-null   object
 1   content            1001 non-null   object
 2   category_name_str  1001 non-null   object
dtypes: object(3)
memory usage: 31.3+ KB

In [24]:
df3.columns

Index(['id', 'content', 'category_name_str'], dtype='object')

In [26]:
df3.describe()

,id,content,category_name_str
count,1001,1001,1001
unique,1001,1001,89
top,0,김영환 전 더불어민주당 의원은 16일 문재인 정부의 탈원전 정책에 대해 과학적으로 ...,etc
freq,1,1,702

In [27]:
df3.shape

(1001, 3)

In [30]:
df.head(3)

  id                                            content
0  0  김영환 전 더불어민주당 의원은 16일 문재인 정부의 탈원전 정책에 대해 과학적으로 ...
1  1  올해 2분기 주요 아티스트들의 대거 복귀를 앞두고 엔터주 주가가 꿈틀거리고 있다 앞...
2  2  더불어민주당 부동산특위는 오늘 국회에서 서울지역 구청장들과 간담회를 하고 부동산 현...

In [31]:
df.tail(3)

        id                                            content
998   1130  1980년 5월 27일 우리를 잊지 말아달라 외치며 진압군에 맞서 마지막까지 전남도...
999   1131  지난달 청년 취업자가 18만명 가까이 증가했지만 이 중 상당수는 아르바이트와 같이 ...
1000  9999                                            content

### *sort*

In [46]:
df3.sort_values(by='category_name_str')

,id,content,category_name_str
1000,9999,content,
622,679,네 그렇습니다택시 공유업체 디디추싱이 금융사업으로발을 넓히듯 모바일 플랫폼 기반 테...,"O2O, 이동수단"
613,668,미프로야구 탬파베이의 최지만이 무릎을 수술하고 돌아온 시즌 첫경기에서 3안타를 몰아...,etc
615,670,스코틀랜드 레인저스를 무패 우승으로 이끈 스티븐 제라드 감독이 레인저스에 대한 진한...,etc
616,671,17일 오전 1시 40분께 경기 남양주시 진접읍의 한 양초 공장에서 불이나 약 1시...,etc
...,...,...,...
842,932,과거 프랑스 중세시대 귀족 남성의 유골을 조사한 결과 한 가지 공통적인 질환의 흔적...,헬스케어
735,816,제2형 당뇨병은 복합적인 원인에 의해 인슐린 저항성이 증가해 발생하는 질병으로 전체...,헬스케어
861,953,심부전 환자의 우울증 발생률이 암 환자보다 더 높다는 연구 결과가 나왔다 심부전은 ...,헬스케어
645,704,성동구는 이달 말부터 로봇재활치료기기 스마트 글로브를 도입 상지기능장애가 있는 지역...,"헬스케어, 로봇, 개발"
360,386,오는 10월부터 의료기관을 개설한 의료법인 비영리법인의 근로자도 내일채움공제에 가...,"헬스케어, 직업"

#

# *find a specific word*

In [8]:
df = df[df.value.str.contains('123')]

In [9]:
df.head()

  value
0   123
1   123
2   123

In [ ]:
df = df[df.value.apply(lambda x: '123' in x)]

#

# *generator with batch*

In [1]:
def batch(iterable, batch_size=1):
    l = len(iterable)
    for ndx in range(0, l, batch_size):                # iterable 데이터를 배치 단위로 확인하며,
        yield iterable[ndx:min(ndx + batch_size, l)]     # batch 단위 만큼의 데이터를 반환

In [2]:
iterable_data = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]    # 데이터 리스트 
batch_size = 3                                        # 배치 사이즈

In [3]:
# iterable 데이터를 배치 단위로 확인하며, batch 단위 만큼의 데이터를 반환
for x in batch(iterable_data, batch_size):
  print(x)

[0, 1, 2]
[3, 4, 5]
[6, 7, 8]
[9, 10]